////----------------------------------------------------------
////LeetCode面试题64. 求1+2+…+n
////求 1+2+...+n ，要求不能使用乘除法、for、while、if、else、
////switch、case等关键字及条件判断语句（A?B:C）。
////----------------------------------------------------------
////思路：
////  利用 && 和 || 不进行部分操作的特性
////作者：Mxd
////时间：2020/06/02
////-----------------------------------------------------------
//#include<iostream>
//using namespace std;
//
//class Solution {
//public:
//    int sumNums(int n){
//        (!n) || (n += sumNums(n - 1));//当n等于0的时候不进行后面的操作
//        return n;
//    }
//};
//
//int main()
//{
//    while (true)
//    {
//        int n;
//        cin >> n;
//        cout << Solution().sumNums(n) << endl;
//    }
//}